---
type: CurveLoopsProfile
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# CurveLoopsProfile

`Autodesk.Revit.DB.CurveLoopsProfile` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Profile | — | `public CurveArrArray Profile { get ; set ; }` |